In [1]:
# https://dplyr.tidyverse.org/reference/with_groups.html

from datar.all import *

In [2]:
df = tibble(g=c(1, 1, 2, 2, 3), x=runif(5))
df >> with_groups(f.g, mutate, x_mean = mean(f.x)) >> ungroup()

   g         x    x_mean
0  1  0.254807  0.130432
1  1  0.006056  0.130432
2  2  0.878056  0.456723
3  2  0.035390  0.456723
4  3  0.823560  0.823560

In [3]:
df >> with_groups(f.g, lambda df: df >> mutate(x1 = first(f.x))) >> ungroup()

   g         x        x1
0  1  0.254807  0.254807
1  1  0.006056  0.254807
2  2  0.878056  0.878056
3  2  0.035390  0.878056
4  3  0.823560  0.823560

In [4]:
df >> \
  group_by(f.g) >> \
  with_groups(None, mutate, x_mean = mean(f.x))

   g         x    x_mean
0  1  0.254807  0.399574
1  1  0.006056  0.399574
2  2  0.878056  0.399574
3  2  0.035390  0.399574
4  3  0.823560  0.399574

In [5]:
df >> \
  group_by(f.g) >> \
  with_groups(None, mutate, g=None)

          x
0  0.254807
1  0.006056
2  0.878056
3  0.035390
4  0.823560